tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "zackelia/formulae"


brew "7zip"
brew "awscli"
brew "coreutils"
brew "deno"
brew "difftastic"
brew "exercism"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "golang"
brew "golang-migrate"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "nim"
brew "nnn"
brew "nvm"
brew "odin"
brew "ollama"
brew "pixi"
brew "podman"
brew "ripgrep"
brew "sqlite"
brew "telnet"
brew "vim"
brew "wget"
brew "yazi"
brew "zig"
brew "zoxide"

cask "anki"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "dbeaver-community"
cask "discord"
cask "figma"
cask "font-hack-nerd-font"
cask "forklift"
cask "freecad"
cask "ghostty"
cask "lm-studio"
cask "logseq"
cask "netnewswire"
cask "numi"
cask "obsidian"
cask "pearcleaner"
cask "podman-desktop"
cask "raycast"
cask "rectangle-pro"
cask "slack"
cask "sublime-text"
cask "uhk-agent"
cask "utm"
cask "vlc"
cask "vscodium"
cask "whatsapp"
cask "zoom"

mas "Amazon Prime Video", id: 545519333
mas "Bee DICOM Viewer", id: 1590273176
mas "Desk Remote Control", id: 1509037746

vscode "DavidAnson.vscode-markdownlint"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "amodio.tsl-problem-matcher"
vscode "codeium.codeium"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ethan-reesor.exp-vscode-go"
vscode "golang.go"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.sonokai"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"