tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "zackelia/formulae"


brew "7zip"
brew "awscli"
brew "coreutils"
brew "deno"
brew "difftastic"
brew "exercism"
brew "fd"
brew "fish"
brew "fzf"
brew "gemini-cli"
brew "git"
brew "golang"
brew "golang-migrate"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "nim"
brew "nnn"
brew "nvm"
brew "odin"
brew "ollama"
brew "pixi"
brew "podman"
brew "repomix"
brew "ripgrep"
brew "sqlite"
brew "sst/tap/opencode"
brew "telnet"
brew "vim"
brew "wget"
brew "yazi"
brew "zellij"
brew "zig"
brew "zoxide"

cask "anki"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "dbeaver-community"
cask "discord"
cask "figma"
cask "font-hack-nerd-font"
cask "forklift"
cask "freecad"
cask "ghostty"
cask "karabiner-elements"
cask "lm-studio"
cask "logseq"
cask "netnewswire"
cask "notion"
cask "numi"
cask "obsidian"
cask "pearcleaner"
cask "podman-desktop"
cask "raycast"
cask "rectangle-pro"
cask "slack"
cask "sublime-text"
cask "uhk-agent"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

mas "Amazon Prime Video", id: 545519333
mas "Bee DICOM Viewer", id: 1590273176
mas "Desk Remote Control", id: 1509037746

vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "DavidAnson.vscode-markdownlint"
vscode "EchoAPI.echoapi-for-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "bradymholt.pgformatter"
vscode "formulahendry.auto-rename-tag"
vscode "html-validate.vscode-html-validate"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "kilocode.kilo-code"
vscode "sst-dev.opencode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-british-english"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vscodevim.vim"
vscode "yandeu.five-server"
vscode "zaaack.markdown-editor"