brew "7zip"
brew "ansible"
brew "awscli"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "deno"
brew "difftastic"
brew "emacs"
brew "exercism"
brew "fd"
brew "fish"
brew "fswatch"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "golang"
brew "golang-migrate"
brew "hyperfine"
brew "jq"
brew "libpq"
brew "llvm"
brew "mise"
brew "mole"
brew "nnn"
brew "nvim"
brew "nvm"
brew "ollama"
brew "openjdk@21"
brew "pi-coding-agent"
brew "pixi"
brew "pnpm"
brew "podman"
brew "prettier"
brew "ripgrep"
brew "sqlite"
brew "sshpass"
brew "stow"
brew "tailscale"
brew "telnet"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "uv"
brew "vim"
brew "wget"
brew "yazi"
brew "zig"
brew "zoxide"

cask "android-studio"
cask "anki"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "forklift"
cask "ghostty"
cask "google-chrome"
cask "handy"
cask "lm-studio"
cask "logseq"
cask "netnewswire"
cask "numi"
cask "obsidian"
cask "pearcleaner"
cask "podman-desktop"
cask "rectangle-pro"
cask "sublime-text"
cask "uhk-agent"
cask "utm"
cask "vlc"
cask "vnc-viewer"
cask "vscodium"
cask "whatsapp"
cask "zoom"
cask "zotero"
